package org.example.task2;

public interface Task2 {

    /**
     * Есть метод, который принимает целое положительное число N.
     * Необходимо посчитать сумму всех чисел от 1 до N включительно и
     * вернуть результат
     *
     * @param n входящее положительное число
     * @return сумма промежутка чисел
     */
    long sumFromOneTo(int n);

    /**
     * Программа на вход получает число.
     * Необходимо вывести таблицу умножения этого числа до 10(включительно)
     *
     * Пример:
     * number = 3
     *
     * 3 х 1 = 3;
     * 3 x 2 = 6;
     * ...
     * 3 x 10 = 30;
     *
     * @param number входящее число
     */
    void formatLine(int number);

    /**
     * Есть метод, который принимает целое положительное число.
     * Необходимо посчитать сумму всех его цифр
     * Например число 567, сумма всех чисел равна = 7 + 6 + 5 = 18(порядок не важен)
     * используйте % и / для получния результата
     *
     * @param number целое положительное число
     * @return сумма всех цифр числа
     */
    int sumOfDigits(int number);

    /**
     * Есть метод, который принимает целое положительное число.
     * Необходимо проверить число полиндром(читается одинаково слева направо и справа налево) или нет
     * Например число 121 - палиндром, потому что, если развернуть, получится то же самое
     * число 321 - не палиндром,
     *
     * @param number целое положительное число
     * @return {@code true}, если число палиндром, иначе {@code false}
     */
    boolean isPalindrome(int number);

    /**
     * Метод принимает целое положительное число
     * Необходимо проверит, что приходящее число является простым
     * Простое число - это число, которое делится только на 1 и на саму себя
     *
     * @param number целое положительное число
     * @return {@code true}, если число простое, иначе {@code false}
     */
    boolean isPrime(int number);
}
