package org.example.tasks1;

public interface Task1 {

    /**
     * Метод принимает одно целочисленное значение.
     * Необходимо реализовать метод,
     * который определит четное или не четное число
     *
     * @param number входящее число
     * @return {@code true}, если четное, иначе {@code false}
     */
    boolean isEven(int number);

    /**
     * В метод приходит два значения, целочисленные.
     * Необходимо определить наибольший из двух переменных и вернуть его
     *
     * @param a целочисленое первое значение
     * @param b целочисленое второе значение
     * @return наибольшее значение
     */
    int findMax(int a, int b);

    /**
     * Пользователь вводит количество баллов (0–100 включительно)
     * (приходит в виде параметров метода).
     * Программа выставляет оценку по шкале:
     * 90–100 — «Отлично»
     * 75–89 — «Хорошо»
     * 60–74 — «Удовлетворительно»
     * 0–59 — «Неудовлетворительно»
     *
     * <p>Задача: необходимо реализовать метод для проверки корректности
     * выставленных баллов и вернуть получаемое значение в соответствии с баллом.</p>
     *
     * @param score количество баллов, введённое пользователем
     * @return текстовое значение в соответствии с баллами
     */
    String isValidScore(int score);

    /**
     * Приходят 2 числа и оператор действия(+, -, *, /).
     * Необходимо реализовать своего рода калькулятор
     * и вернуть полученное значение.
     * (тут можно и через switch)
     *
     * @param a первое число
     * @param b второе число
     * @param operator оператор выполнения
     * @return целочисленый ответ результата операции
     */
    int calculate(int a, int b, char operator);

    /**
     * Метод принимать 3 параметра сторон треугольника. Нобходимо сделать следующие:
     * 1. Проверить, существует ли такой треугольник (сумма любых двух сторон больше третьей).
     * 2. Если существует — определить его тип: равносторонний, равнобедренный или разносторонний.
     * 3. Если не существует — вывести сообщение об ошибке.
     * сообщение ошибки = "Данные не валидны. Треугольник не существует"
     *
     * @param a сторона треугольника
     * @param b сторона треугольника
     * @param c сторона треугольника
     * @return результат выполнения программы(тип треугольника или ошибку)
     */
    String isValidTriangle(double a, double b, double c);

    /**
     * Метод принимает 4 параметра для подсчета стоимости билета.
     * Необходимо реализовать логику подсчета в соответствии с параметрами и правилами.
     * Правила:
     * Дети до 7 лет — бесплатно.
     * Школьники (7–17) — скидка 50%.
     * Студенты (18–25 и isStudent == true) — скидка 30%.
     * Пенсионеры (от 60) — скидка 40%.
     * В выходные (суббота, воскресенье) — дополнительная скидка 10% поверх возрастной(то есть доп скидка к другим).
     * Если итоговая цена меньше 0 — считать её равной 0.
     *
     * @param basePrice базовая стоимость билета
     * @param age возраст пассажира
     * @param isStudent является ли пассажир студентом (true/false)
     * @param dayOfWeek день недели поездки (1–7)
     * @return стоимость билета
     */
    long calculateFinalPrice(double basePrice, int age, boolean isStudent, int dayOfWeek);
}
